app/Http/Controllers/ProductController.php

    public function index()
    {
      $products = Product::all();
---
select * from `products`

    public function store(Request $request)
    {
      // validazione dei dati in ingresso
      $validatedData = $request->validate([
        'name' => 'required|max:255|bail',
        'description' => 'required',
        'price' => 'required|numeric|between:0,9999.9',
        'sale_price' => 'required|numeric|between:0,9999.9',
        'category' => 'required|max:255',
      ]);

      //dd($request->all());

      //prendo dati dal form
      $dati = $request->all();

      //dd($dati);
      //creo nuovo oggetto
      $nuovo_prodotto = new Product();
      //oppure
      //$nuovo_prodotto->name = $dati['name'];
      //etc.. con tutti
      //compila l'ggeto con questi dati
      $nuovo_prodotto->fill($dati);
      $nuovo_prodotto->save();
---
insert into `products` (`name`, `description`, `price`, `sale_price`, `category`, `updated_at`, `created_at`) values ('fogli', 'dada', '4', '3', 'cancelleria', '2019-07-10 15:22:33', '2019-07-10 15:22:33')

    public function destroy($id)
    {
        //recupero id
        $prodotto = Product::find($id);
        $prodotto->delete();
---
delete from `products` where `id` = 9